demo-output/website/unsteady-cylinder/re100/case/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}


application     pimpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         100.0;
deltaT          0.005;
adjustTimeStep  yes;
maxCo           1.5;
maxDeltaT       0.5;
writeControl    adjustableRunTime;
writeInterval   100.0;
purgeWrite      1;
writeFormat     ascii;
writePrecision  10;
timeFormat      general;
timePrecision   8;

functions
{
    forceCoeffs1
    {
        type            forceCoeffs;
        libs            (forces);
        writeControl    timeStep;
        writeInterval   1;
        patches         (cylinder);
        rho             rhoInf;
        rhoInf          1.0;
        magUInf         1.0;
        lRef            1.0;
        Aref            0.1;
        CofR            (0 0 0);
        dragDir         (1 0 0);
        liftDir         (0 1 0);
        pitchAxis       (0 0 1);
    }
    yPlus1
    {
        type            yPlus;
        libs            (fieldFunctionObjects);
        executeControl  onEnd;
        writeControl    onEnd;
    }
}
